ESI/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      @C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//#include        "include/initialConditions";

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   "(South|East|floor|top)" 		//outlet
    {
	    type		zeroGradient;
    }

    "(West|North)"		//inlet
    {
        type            zeroGradient;
    }

    "(MUST)"		//buildings
    {
        type            zeroGradient;
    }

    

    floor
   { 
       type            zeroGradient; 
   }


    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //


