ESI/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    South		//outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    West		//inlet
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditions";
    }

    East		//outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    North		// inlet
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditions";
    }

    top			//top
    {
        type            slip;
    }

    "(MUST)"		//buildings
    {
        type            uniformFixedValue;
        value           uniform (0 0 0);
        uniformValue    constant (0 0 0);
    }
    

    floor
   { 
       type            uniformFixedValue; 
       value           uniform (0 0 0); 
       uniformValue    constant (0 0 0); 
   }

    #includeEtc "caseDicts/setConstraintTypes"
    
}


// ************************************************************************* //
