ESI/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

Uref                 3.0;
Zref                 7.29;
zDir                 (0 0 1);
flowDir              (0.7071067811865471 -0.7071067811865479 0);
z0                          uniform 0.01833;

zGround              uniform 0;

// ************************************************************************* //
