ESI/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (0.7071067811865471 -0.7071067811865479 0);
pressure             0;
turbulentKE          1.0730006198490254;
turbulentEpsilon     0.055076624985527435;


// ************************************************************************* //
