ESI/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    South		//outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE;
        value           $internalField;
    }

    West		//inlet
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
    }

    East		//outlet	
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE;
        value           $internalField;
    }

    North		//inlet
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
    }



    top			//top
    {
        type            slip;
    }

    "(MUST)"		//buildings	
    { 
	    type            kqRWallFunction;
        value           uniform 0.0; 
    }
    
    

    floor
   { 
       type            kqRWallFunction; 
       value           uniform 0.0;
   }


    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
