ESI/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include "include/ABLConditions"

    South		//outlet
    {
        type            calculated;
        value           uniform 0;
    }

    West		//inlet
    {
        type            calculated;
        value           uniform 0;
    }

    East		//outlet
    {
        type            calculated;
        value           uniform 0;
    }

    North		//inlet
    {
        type            calculated;
        value           uniform 0;
    }
	

    top			//top
    {
        type            slip;
    }

    "(MUST)"		//buildings
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
    

    floor
   { 
       type            nutkAtmRoughWallFunction; 
       z0              $z0; 
       value           uniform 0.0; 
   }


    #includeEtc "caseDicts/setConstraintTypes"

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
