ESI/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Laminar Schmit number
transportModel  Newtonian;

nu             nu  [0 2 -1 0 0 0 0] 1.5e-05;

Sc             Sc [0 0 0 0 0 0 0] 0.7;

// Turbulent Schmit number

Sct             Sct [0 0 0 0 0 0 0] 0.6;

// ************************************************************************* //

// ************************************************************************* //
