ESI/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    C
    {
      solver           smoothSolver;
      smoother         GaussSeidel;
      tolerance        1e-6;
      relTol           0.01;
      nSweeps          3;
      maxIter          100;
      minIter          10;
    }
}

SIMPLE
{
    residualControl
    {
        p               1e-8;
        U               1e-8;
        "(k|omega|epsilon)" 1e-8;
	C		1e-8;
    }
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.6;
    }
    equations
    {
        U               0.6;
        "(k|omega|epsilon).*" 0.6;
        C	 0.6;
    }
}

// ************************************************************************* //
