ESI/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

fields       (U C);

surfaceFormat raw;

surfaces
(
    z2m
{
$cuttingPlane; 
pointAndNormalDict 
{
    basePoint    (0 0 2); 
    normalVector $z;      
}
}
z5m
{
$cuttingPlane; 
pointAndNormalDict 
{
    basePoint    (0 0 5); 
    normalVector $z;      
}
}

);

// ************************************************************************* //
